{
  "involvements": [
    {
      "title": "Meeting Reservation Specialist",
      "organization": "Husky Union Building",
      "date": "Sep 2024 - Present",
      "points": [
        "Developed a dual-mode email automation script using Excel VBA and HTML/CSS to standardize event compliance communication, resulting in a 6x increase in workflow efficiency and the elimination of manual data entry errors.",
        "Drafting detailed quotes and managed event logistics for 200+ events in the HUB by coordinating client needs, AV requirements, and service restrictions, ensuring smooth planning and high client satisfaction."
      ]
    },
    {
      "title": "Analog Electronic Researcher",
      "organization": "PIONEER Experiment, Experimental Nuclear Physics and Astrophysics (CENPA)",
      "date": "Sep 2025 - Present",
      "points": [
        "Analyzed FAST3 output inconsistencies by modeling circuit topology as a graph, revealing emergent AND/OR-like interactions between resistive elements that distorted channel gain mapping."
      ]
    },
    {
      "title": "Data Science Lead & Web Developer",
      "organization": "The Boring Club at UW",
      "date": "Sep 2024 - Present",
      "points": [
        "Leading the club to develop a real-time machine learning facial recognition attendance checker using live camera data, applying data engineering and model training techniques to enable accurate and efficient image classification.",
        "Built and maintained the organization's website, growing traffic to 10,000 visitors and expanding online engagement."
      ]
    },
    {
        "title": "Member",
        "organization": "Batman's Kitchen",
        "date": "Sep 2025 - Present",
        "points": [
          "Batman's Kitchen at the University of Washington is a club that participates in CTFs and CCDC, as well as other competitons to sharpen cyber security skills.",
          "Competing in the Embedded Capture the Flag (eCTF) embedded security competition run by MITRE to design secure embedded systems against cyber attacks."
        ]
      }
  ]
}
